Revit 2027 API
ParameterTypeId.StructuralBeamEnd0Elevation Property
 "Start Level Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamEnd0Elevation { get; }
Public Shared ReadOnly Property StructuralBeamEnd0Elevation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamEnd0Elevation {
	ForgeTypeId^ get ();
}
static member StructuralBeamEnd0Elevation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace